# InitialWattageIntensity Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
InitialWattageIntensity Class
Members See Also
---
This class encapsulates initial wattage intensity calculation.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class InitialWattageIntensity : InitialIntensity
```

Visual Basic
---
```text
Public Class InitialWattageIntensity _
	Inherits InitialIntensity
```

Visual C++
---
```text
public ref class InitialWattageIntensity : public InitialIntensity
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Lighting..::..InitialIntensity Autodesk.Revit.DB.Lighting..::..InitialWattageIntensity
# See Also
InitialWattageIntensity Members
Autodesk.Revit.DB.Lighting Namespace